public class TODO {

    //TODO اضافه کردن لودینک با تایمر برای جلوگیری از لمس دوباره دکمه ها
    //TODO زمان اتمام کار تعمیر کار در صورت ذخیره نبودن قطعه در لاگ قبلی و زدن دکمه اتمان کار خطا گرفته شود
    //TODO در صورت ثبت فاکتور و پرداختی در کارت نمایش داده شود
    //TODO اضافه کزدن تازیخ دلخوا برای دورد و خروج از انبار
    //TODO اضافه کزدن تازیخ دلخوا برای صدور فاکتور
    //TODO سرچ بر اساس قسمتی از پلاک
    //TODO نوع سوخت به صورت گزینه ای  درباپ دان باکس باشد
    //TODO اصلاح اطلاعات یک ماشین باید شامل تغییر پلاک ماشین هم شود. یعنی از ای دی استفاده کنید

}
